{
	"communications": {
		"install_lib_mex": "If there are any slowness issues, try disconnecting the VPN if you are using it. We are also looking to buy more servers around the world to improve performance. Thank you for the support. Andrew_D",
		"emergency": ""
	},
	"workinprogressblock": {
		"lock_operators": [
			""
		],
		"description": ""
	},
	"updates": {
		"4.0.130": {
			"date": "09-03-2022",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "BuxFix - No Preview in data image list",
					"description": "No Preview for the images in the list in the generation of normal maps and into search data images (Ops). We fixed it."
				},
				"2": {
					"title": "Improved - Reprojection button on Fx Layer Menu",
					"description": "Added a Re-project button on Fx Layer Menu. This button was only present in the inter-module painting."
				},
				"3": {
					"title": "Improved - FAQs Button",
					"description": "A FAQs button has been added in some parts of the addon. It will also be accessible by pressing the Helps button in the Main interface"
				},
				"4": {
					"title": "Fixed - ShaderMaker Paint Error",
					"description": "Error when trying to add a Shadermaker Paint to a Curve object"
				},
				"5": {
					"title": "Fixed - Bake Error for Glass",
					"description": "An error arose when some materials such as Glass were tempted to Bake. This is because if you tried to Bake the Normal map of the Glass, since there was no normal map, the addon tried to connect the Normal node (Which in this case did not exist) to the BSDF node during the bake. We have put an exception in the Links function which raises an exception in case the links cannot be created."
				},
				"5": {
					"title": "Added-Fixed - Create New UV Map added into Bake editor",
					"description": "After a few Bake reports, we have found a solution to Bake so that if the object does not have a correct UV mapping, you can choose to Create a new UV map. It will be projected with the Blender Pack Islands system. While previously a Smart Projection method was used, which did not meet the need, we had provisionally removed it, but many inexperienced users were expecting immediate Bake without having to change the UV mapping (Rightly so). We think this is my best method for now. Looking forward to new features"
				},
				"6": {
					"title": "Fixed - Error when UV Maps are 8-slot",
					"description": "Blender has a limit of 8 UV Layers, so we had an Error when some Operators gave Error if the UV Layers were 8. An additional check has been added, and a message will be shown if this happens"
				},
				"7": {
					"title": "improvement - Bake improvement",
					"description": "The bake has been improved. Now you can do 3 different types of Bake. It is now also possible to bake non-Extreme PBR materials. The three types are 1 - Bake Based on BSDF Principled Materials. 2 - Classic Bake by Cycles. 3 - Classic Bake Combined by Cycles. Everything is ready to bake in just a few steps. In addition Previously in Bake we used a Smart Projection, but it was not a good idea, now we use the PackIsland method, this greatly improves the output uv mapping."
				},
				"8": {
					"title": "improvement - Texture Browser Addes",
					"description": "In the material shader editor you can now access the new Texture Browser menu. All textures present in Extreme PBR can now be searched through this menu, and added directly to a Texture Image node in the node tree"
				},
				"9": {
					"title": "improvement - Panel Builder Helper",
					"description": "The Panel Builder Helper has now been improved. It turns out cleaner and less confusing. A Socket slot viewer has also been added."
				},
				"10": {
					"title": "improvement - Simple PBR material options Added",
					"description": "Now it is possible to create simple PBR materials, without Nexus node tree, so as to create a Base node tree, which you can modify at will. PLEASE NOTE: it is not possible to paint over it for the moment or add a fx layer. if you want to do this you have to use Nexus materials!"
				},
				"11": {
					"title": "improvement - Painter",
					"description": "Now the default Painter shows all the maps turned off (Mute), except the diffuse one. This is to avoid problems on the Macintosh Users, as Macintosh does not currently support many textures on the same material"
				},
				"12": {
					"title": "Provisional Patch- Texture Limiter",
					"description": "Due to limitations on Mac systems, as it is known that there is a maximum number of textures on a single material, and it is very limited. A function has been added that recognizes if the computer is a Mac System. So it automatically limits the use of textures on materials, so you can mix more of them. This is a momentary patch pending Vulkan on Blender API, hopefully they will be added as soon as possible, this is a limitation for Macintosh users."
				},
				"13": {
					"title": "improvement - Old Extreme PBR (Combo-Evo) panel properties",
					"description": "Now, in the panel it is possible to return to view the sliders of the old Extreme PBR (Combo-Evo) materials, it is not identical to before, but it is quite similar."
				},
				"14": {
					"title": "improvement - Slider On the Extreme PBR panel",
					"description": "If you are using a material based on a Principled BSDF node connected directly to the output, you can now view the sliders in the Extreme PBR panel. If the inputs of the Principled BSDF are connected, the sliders of the node from which they are connected will also be shown (Both Normal Node and Group node)"
				},
				"16": {
					"title": "bug fix- Add Material From User Library",
					"description": "An error occurs when the material is applied, this did not compromise the correct functioning, but it was very annoying. Fixed"
				}
			}
		},
		"4.0.129": {
			"date": "30-12-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "BuxFix - Expansion Libraries",
					"description": "We have fixed some errors in the management of Expansion Libraries."
				}
			}
		},
		"4.0.128": {
			"date": "24-12-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Improved - Access Data Stored",
					"description": "A new folder will be created with the right credentials to ensure that the last correct credentials with which the addon was activated are always available, in case of update."
				},
				"2": {
					"title": "Fix - Message Incompatibility with Beta-Alpha Version",
					"description": "Fixed Incompatibility with Beta-Alpha Version Message"
				},
				"3": {
					"title": "Improved - Keep track of libraries",
					"description": "Now the addon keeps track of where the libraries are, automatically recognizes the paths (if they still exist) useful for multiple installations of Extreme PBR on various versions of Blender"
				},
				"4": {
					"title": "Improved - Added first boot message System",
					"description": "At the first launch of Extreme PBR, a message may be displayed with the important news of the update"
				},
				"5": {
					"title": "Improved - Improved the fluidity of the interface",
					"description": "Improved the fluidity of the interface, now the panels in general are more fluid with less 'Lag'. We will continue to try to improve fluidity with future releases as well."
				},
				"6": {
					"title": "Improved - Increased the timeout",
					"description": "We have raised the timeout threshold to improve the download while the user is not at the computer. Translated, there is less risk of the download stopping while it is downloading by itself. We are still trying to improve the speed service."
				}
			}
		},
		"4.0.127": {
			"date": "19-12-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "BugFix - Save Material Preview Icons",
					"description": "It was impossible to change the type of Previews icon, and also the background for the lighting. We fixed it."
				},
				"2": {
					"title": "Improved - Get Register Button",
					"description": "We have added a modal and a progress bar to not freeze the interface while getting the library list."
				},
				"3": {
					"title": "Improved - Create Library Structure",
					"description": "We have added a modal for creating the library structure. A progress bar has also been added. This no longer freezes the Blender interface"
				},
				"4": {
					"title": "Added - Installed Library Percentage",
					"description": "Added a status bar on the installation of the entire library. Viewable in Options. It is used to see how much of the online library has been installed."
				},
				"5": {
					"title": "Fix - Problem 'License in use on another computer'",
					"description": "This annoying problem has been solved. The problem was on computers with multiple network cards or with WiFi and Lan connections. It can now store up to 3 different computer configurations. You will need to perform a Device Reset to take effect!"
				}
			}
		},
		"4.0.126": {
			"date": "10-12-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "BugFix - SSL Certificate Verify",
					"description": "We changed the SSL certificates, so the installer should work better now. Some were having problems with increasing response time to our server because of this. Please install this version"
				},
				"2": {
					"title": "Improved - Helps Text",
					"description": "Added some more help messages for beginners."
				}
			}
		},
		"4.0.125": {
			"date": "08-12-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "BugFix - Save Material with FX",
					"description": "An error was shown when saving the complete material with FX Module and made it impossible to save a material with an Fx Layer inside it"
				},
				"2": {
					"title": "Improved - Check Updates Panel",
					"description": "New buttons to show or hide all update details"
				},
				"3": {
					"title": "BugFix - Search Image From Texture Manager Panel",
					"description": "The search for images was aborted if an image did not actually exist. This was due to a preview error, as it did not exist."
				},
				"4": {
					"title": "BugFix - Bake",
					"description": "An error was shown on occasion when attempting to bake an object whose name contained an underscore. We solved by unlinking this process from the object name. This happened in the assignment of the Baked maps at the moment of insertion in the Textures nodes."
				},
				"4": {
					"title": "Improved - License Check",
					"description": "A 36 character license length check was added, many users were confused about which license to enter. This additional check indicates if the license entered is not of the correct length."
				},
				"5": {
					"title": "Improved - Extreme Addons License Help Buttons ",
					"description": "We added 2 Helps buttons in the Extreme Addons tab, during the addon activation phase, some users had no idea how to continue. These 2 new buttons lead to some useful pages of extreme-addons website."
				},
				"5": {
					"title": "Fix - Image lost data (has_data API)",
					"description": "Officially, Blender 3.0.0 has an API bug. So it is no longer possible to check if the texure is still connected on the disk. We have made a temporary system that checks that the textures are still linked to the file. Only if the textures are not Packed"
				}
			}
		},
		"4.0.124": {
			"date": "05-12-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "SSL Certificate Problem Blender 3.0",
					"description": "On Blender 3.0 we encountered problems with connection certificates to our server. This made it impossible to connect again to download the libraries. We have now fixed this. If you are unable to update with Update core. You will need to download the addon from the MarketPlace you purchased it from and replace it."
				}
			}
		},
		"4.0.123": {
			"date": "04-12-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Fixed - Bake with Smart Projection",
					"description": "We noticed that Bake remained with a smart projection, while programming Extreme PBR we had escaped to disable Smart Projection during Bake, this did Bake objects with a new smart mapping. This was awful, and we had forgotten it turned on. Now the Bake will use the user's active UV mapping. We thank our very scrupulous user for this report."
				},
				"2": {
					"title": "Fixed - Fx Layer Decals Bug",
					"description": "The mask used when applying a decal FX Layer was not placed correctly on the Alpha map, and therefore the result was an unexpected transparency. Now this has been fixed, and the Alpha map will act as a Mask map, as it was originally meant to be."
				},
				"3": {
					"title": "Fixed - Fx Layer",
					"description": "The Alpha texture was disconnected from the Mapping node, so it was impossible to scale it along with the entire FX Layer. Now solved"
				},
				"4": {
					"title": "Added - Bake Device Selection",
					"description": "Added choice for Bake (Cpu-Gpu)"
				}
			}
		},
		"4.0.122": {
			"date": "29-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Fixed - Bug on Bake",
					"description": "When trying to bake an object with multiple maps, with the Normal map mode active, it gave an error. It is now solved."
				},
				"2": {
					"title": "Added - New text Box into installer",
					"description": "A new box for communication texts during installation of libraries has been added."
				},
				"3": {
					"title": "Added - Debug Checkbox for installer stats",
					"description": "A new button to show more statistics during installation has been added in the Options menu."
				}
			}
		},
		"4.0.121": {
			"date": "26-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Fixed - Bug on Search Module/Fx Button",
					"description": "When trying to search for a Module or a Layer Fx, using the small buttons (m) and (fx), an error appeared and made it impossible to replace. Resolved"
				}
			}
		},
		"4.0.120": {
			"date": "24-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Fixed - Emission on Blender 2.83 to Blender 2.9",
					"description": "We fixed a bug that occurred on Versions prior to 2.91 through 2.83. The emissivity property was not controllable. We have reactivated a multiplier node for emissivity. (Press Adjust node tree to fix if you are in production)"
				},
				"2": {
					"title": "Implemented - Multiple Adjust Node",
					"description": "We have added a button (Adjust All Material node Tree) in the Options menu. This fixes all possible broken Materials, or possibly for a passage of a project created with Blender 2.83 to Blender 2.93+ due to the fact that the nodes are slightly different due to the missing Emission Strength socket. This operator fixes everything in one go."
				}
			}
		},
		"4.0.119": {
			"date": "22-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Remove Material Bug On lower versions of Blender 2.91",
					"description": "We have excluded the APIs showing this error on versions prior to Blender 2.91. Everything works the same as before on the higher versions."
				},
				"2": {
					"title": "Emission Bug On lower versions of Blender 2.91",
					"description": "On versions prior to 2.91 some materials looked White, actually it was the emissivity set to white by default on the Principled BSDF, now it is set to Black, so no emissivity effect that gave the White effect will happen again."
				}
			}
		},
		"4.0.118": {
			"date": "19-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": true,
			"lock_operators": [
				"EXTREMEPBR_OT_GetAllLibraries"
			],
			"descriptions": {
				"1": {
					"title": "Security Check Error Fix.",
					"description": "For security reasons we have blocked some operators who use our server. This Block was giving an error. It has now been fixed."
				},
				"2": {
					"title": "Bug on Get Register Fix",
					"description": "We fixed a communication error with our server that happened when this operator was pressed."
				}
			}
		},
		"4.0.117": {
			"date": "15-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Password Bug",
					"description": "Users reported that if they used some special characters in the password (such as quotation marks) it was not possible to activate the addon. We have now solved the problem. We thank some customers for reporting."
				}
			}
		},
		"4.0.116": {
			"date": "12-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Improved Displace",
					"description": "Now if the object has other modifiers, the Modifier's subdivision, as a precaution, is set to 1. The displace will always keep a smart subdivision count, based on how many polygons the object you are working on has. This is to keep Blender from freezing too long on complex objects."
				},
				"2": {
					"title": "Show Hidden Password/License",
					"description": "We noticed that some users were having trouble figuring out if the Mail/Password/License was right. We have put Show / Hide buttons next to each field in the license activation menu"
				}
			}
		},
		"4.0.115": {
			"date": "06-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "First Installation Issue",
					"description": "Problem when the user tries to move the libraries, and by mistake does the 'First Installation' the process starts over. Now this has been fixed."
				},
				"2": {
					"title": "Installation Interface Hidden",
					"description": "During installation, the Extreme PBR interface has been made hidden so as not to create a situation of being able to use Extreme PBR during installation as it could be a risk of installation breakdown. Fixed"
				}
			}
		},
		"4.0.113": {
			"date": "02-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Material Boolean Button",
					"description": "On some occasions, the boolean button in the material properties showed an error. We fixed it"
				}
			}
		},
		"4.0.112": {
			"date": "01-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Fixed Libraries Bug",
					"description": "Fixed the problem that occurred on Mac and Linux, after pressing 'Create Structure' the folders were created incorrectly (Only on Mac and Linux)"
				},
				"2": {
					"title": "Options Button",
					"description": "It happened that by pressing the 'Options' button a CONTEXT error was shown. Resolved"
				}
			}
		},
		"4.0.111": {
			"date": "29-11-2021",
			"name": "Extreme PBR",
			"edition": "Nexus",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Fixed Bake Error",
					"description": "We fixed the API error about tile_x / tile_y, as these bees in Blender 3.0 have changed."
				},
				"2": {
					"title": "No More News",
					"description": "#"
				}
			}
		}
	}
}
